export class Lightsaber implements Spinner {
    interval = 80;
    frames = [
        "ϾΞШШШΞӖӖҪ                                ",
        "ϾΞШШШΞӖӖҪӝӝ                              ",
        "ϾΞШШШΞӖӖҪӝӝӝӝ                            ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝ                        ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝ                    ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝ                ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝ            ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝ          ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝ      ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝ      ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝ          ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝ            ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝӝ                ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝӝӝӝӝ                    ",
        "ϾΞШШШΞӖӖҪӝӝӝӝӝӝӝӝ                        ",
        "ϾΞШШШΞӖӖҪӝӝӝӝ                            ",
        "ϾΞШШШΞӖӖҪӝӝ                              ",
        "ϾΞШШШΞӖӖҪ                                ",
    ];
}
